Extensions/нп_КонтрольПроведенияПоДО/configurator/InformationRegisters/нп_НастройкиКонтроляПроведенияПоДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties><Name>нп_НастройкиКонтроляПроведенияПоДО</Name>					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтборПоРеквизитам</Name>
					<Type><v8:Type>v8:ValueStorage</v8:Type></Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчастникиКонтроля</Name>
					<Type><v8:Type>v8:ValueStorage</v8:Type></Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_КонтрольПроведенияПоДО/configurator/Enums/нп_ВидыСтрокУчастниковКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>нп_ВидыСтрокУчастниковКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исключая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/нп_КонтрольПроведенияПоДО/configurator/InformationRegisters/нп_НастройкиКонтроляПроведенияПоДО/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораДокументов();
	ОбновитьДоступныеПоляОтбора();
	ЗагрузитьОтборИзХранилища();
	ЗагрузитьУчастниковИзХранилища();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОтборПоРеквизитам = Новый ХранилищеЗначения(КомпоновщикОтбора.Настройки);
	ТекущийОбъект.УчастникиКонтроля = Новый ХранилищеЗначения(ТаблицаУчастниковВЗначение());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолноеИмяОбъектаМетаданныхПриИзменении(Элемент)
	
	ОбновитьДоступныеПоляОтбора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораДокументов()
	
	Элементы.ПолноеИмяОбъектаМетаданных.СписокВыбора.Очистить();
	
	Для Каждого ЭлементСписка Из нп_КонтрольПроведенияПоСогласованиюДО.СписокДокументовДляВыбора() Цикл
		Элементы.ПолноеИмяОбъектаМетаданных.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступныеПоляОтбора()
	
	ПолноеИмя = Запись.ПолноеИмяОбъектаМетаданных;
	Если ПустаяСтрока(ПолноеИмя) Тогда
		КомпоновщикОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
		Возврат;
	КонецЕсли;
	
	СнимокНастроек = Неопределено;
	Если нп_КонтрольПроведенияПоСогласованиюДОКлиентСервер.ЕстьАктивныеЭлементыОтбора(КомпоновщикОтбора.Настройки.Отбор) Тогда
		СнимокНастроек = Новый ХранилищеЗначения(КомпоновщикОтбора.Настройки);
	КонецЕсли;
	
	Схема = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = Схема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "ОсновнойНабор";
	НаборДанных.Запрос = "ВЫБРАТЬ * ИЗ " + ПолноеИмя + " КАК ОсновнаяТаблица";
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	Схема.ПоляИтога.Очистить();
	
	АдресСхемы = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикОтбора.Инициализировать(Источник);
	
	Если СнимокНастроек <> Неопределено Тогда
		Попытка
			ВосстановленныеНастройки = СнимокНастроек.Получить();
			КомпоновщикОтбора.ЗагрузитьНастройки(ВосстановленныеНастройки);
		Исключение
			ЗагрузитьОтборИзХранилища();
		КонецПопытки;
	Иначе
		ЗагрузитьОтборИзХранилища();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОтборИзХранилища()
	
	ОтборПоРеквизитам = Запись.ОтборПоРеквизитам;
	Если Не ЗначениеЗаполнено(ОтборПоРеквизитам) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СохраненныеНастройки = ОтборПоРеквизитам.Получить();
		Если ТипЗнч(СохраненныеНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
			КомпоновщикОтбора.ЗагрузитьНастройки(СохраненныеНастройки);
		КонецЕсли;
	Исключение
		// повреждённое хранилище — оставляем пустой отбор
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУчастниковИзХранилища()
	
	Участники.Очистить();
	
	Хранилище = Запись.УчастникиКонтроля;
	Если Не ЗначениеЗаполнено(Хранилище) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗначениеХранилища = Хранилище.Получить();
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(ЗначениеХранилища) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ЗначениеХранилища Цикл
		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Участник = СтрокаТаблицы.Участник;
		НоваяСтрока.ВидСтроки = СтрокаТаблицы.ВидСтроки;
		Если Не ЗначениеЗаполнено(НоваяСтрока.ВидСтроки) Тогда
			НоваяСтрока.ВидСтроки = Перечисления.нп_ВидыСтрокУчастниковКонтроля.Включая;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаУчастниковВЗначение()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Участник");
	Результат.Колонки.Добавить("ВидСтроки");
	
	Для Каждого СтрокаФормы Из Участники Цикл
		Если Не ЗначениеЗаполнено(СтрокаФормы.Участник) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Участник = СтрокаФормы.Участник;
		НоваяСтрока.ВидСтроки = СтрокаФормы.ВидСтроки;
		Если Не ЗначениеЗаполнено(НоваяСтрока.ВидСтроки) Тогда
			НоваяСтрока.ВидСтроки = Перечисления.нп_ВидыСтрокУчастниковКонтроля.Включая;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
